#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.LuaLepAPI.heroku_app.lualep: Refreshing state... [id=lua-lep-api]
module.LuaLepAPI.heroku_domain.lualep: Refreshing state... [id=57de8848-8892-4e2e-a0d0-97b7c015c756]
module.LuaLepAPI.heroku_build.lualep: Refreshing state... [id=cbc59241-16c7-4a94-8dbb-c75e42011cbe]
module.LuaLepAPI.cloudflare_record.lualep: Refreshing state... [id=2630f3fe94260d5f1cd60b33ad5a089e]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.TestReady.cloudflare_record.testready will be created
  + resource "cloudflare_record" "testready" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "testready"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = "0783d89a07c4a168916840cd39a8bc00"
    }

  # module.TestReady.cloudflare_record.www_testready will be created
  + resource "cloudflare_record" "www_testready" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www.testready"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = "0783d89a07c4a168916840cd39a8bc00"
    }

  # module.TestReady.heroku_addon.database will be created
  + resource "heroku_addon" "database" {
      + app         = (known after apply)
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

  # module.TestReady.heroku_addon.redis will be created
  + resource "heroku_addon" "redis" {
      + app         = (known after apply)
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-redis:hobby-dev"
      + provider_id = (known after apply)
    }

  # module.TestReady.heroku_app.testready will be created
  + resource "heroku_app" "testready" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "testready-megatunger"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.TestReady.heroku_build.testready will be created
  + resource "heroku_build" "testready" {
      + app               = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-ruby.git",
        ]
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + source            = {
          + "url" = "https://github.com/megatunger/testready/archive/master.tar.gz"
        }
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)
    }

  # module.TestReady.heroku_domain.testready will be created
  + resource "heroku_domain" "testready" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "testready.megatunger.com"
      + id       = (known after apply)
    }

  # module.TestReady.heroku_domain.www_testready will be created
  + resource "heroku_domain" "www_testready" {
      + app      = (known after apply)
      + cname    = (known after apply)
      + hostname = "www.testready.megatunger.com"
      + id       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @megatunger, Action: `pull_request`*